<?php
// PHPの研修カリキュラム2-1
?>
<?php
/*
PHPの
研修
カリキュラム
2-1
*/
?>
<html>
    <p>I say that <?php echo "Hello World!!"; ?></p>
</html>
<?php
echo "1.開発環境・検証環境・本番環境"."<br>";
echo "開発環境：機器やソフトウェア、システムを開発するために必要な機材やソフトウェアなどの組み合わせ。ローカル環境。<br>
検証環境：制作内容に問題が無いか検証する環境。<br>
本番環境：できあがったシステムやサービスが実際に動く環境。
"."<br>";
echo "2.基本設計書・詳細設計書"."<br>";
echo "基本設計書：顧客の要件を実現するためのシステム構成や機能を記したもの。<br>
詳細設計書：基本設計で決められた動きを「どうやって実現するか？」を説明した資料。
"."<br>";
echo "3.Ajax"."<br>";
echo "Ajaxとは、あるWebページを表示した状態のまま、別のページや再読込などを伴わずにWebサーバ側と通信を行い、動的に表示内容を変更する手法。"."<br>";
?>